dixitadarsharavi/Implementation-of-PWM-and-power-analysis-using-MSP430/main.c
#include "lcd.h"

#include<driverlib.h>

volatile unsigned char * mode = &BAKMEM4_L;
volatile unsigned char * S1buttonDebounce = &BAKMEM2_L;       // S1 button debounce flag
volatile unsigned char * S2buttonDebounce = &BAKMEM2_H;       // S2 button debounce flag
volatile unsigned int holdCount = 0;
volatile unsigned long start = 0;

Timer_A_initUpModeParam initUpParam_A0 =
{
        TIMER_A_CLOCKSOURCE_SMCLK,              // SMCLK Clock Source
        TIMER_A_CLOCKSOURCE_DIVIDER_1,          // SMCLK/1 = 2MHz
        30000,                                  // 15ms debounce period
        TIMER_A_TAIE_INTERRUPT_DISABLE,         // Disable Timer interrupt
        TIMER_A_CCIE_CCR0_INTERRUPT_ENABLE ,    // Enable CCR0 interrupt
        TIMER_A_DO_CLEAR,                       // Clear value
        true                                    // Start Timer
};


int main(void)
{
    WDTCTL = WDTPW | WDTHOLD;  // stop watchdog timer

     if (SYSRSTIV == SYSRSTIV_LPM5WU)
        {
            //Init_GPIO();
            __enable_interrupt();


        }
     else
     {
    Init_GPIO();
    LCD_init();
    P1DIR |= BIT6 | BIT7;                      // P1.6 and P1.7 output
    P1SEL0 |= BIT6 | BIT7;                     // P1.6 and P1.7 options select

    GPIO_clearInterrupt(GPIO_PORT_P1, GPIO_PIN2);
    GPIO_clearInterrupt(GPIO_PORT_P2, GPIO_PIN6);

    *S1buttonDebounce = *S2buttonDebounce  = 0;  // debouncing

    __enable_interrupt();

    displayScrollText("WELCOME TO ARD");
    //return 0;  not needed as it will terminate the code
     }


//int i = 0x01;
//
//while(1)
//{
//    LCD_E_selectDisplayMemory(LCD_E_BASE, LCD_E_DISPLAYSOURCE_MEMORY);
////    switch(*mode)
////    {
////        case STARTUP_MODE:        // Startup mode
////
////
////            // Cycle through all LCD segments and display instruction message
////            if (i <= 0x80)
//           // {
//                LCDMEM[pos1] = LCDMEM[pos1+1] = i;
//                LCDMEM[pos2] = LCDMEM[pos2+1] = i;
//                LCDMEM[pos3] = LCDMEM[pos3+1] = i;
//                LCDMEM[pos4] = LCDMEM[pos4+1] = i;
//                LCDMEM[pos5] = LCDMEM[pos5+1] = i;
//                LCDMEM[pos6] = LCDMEM[pos6+1] = i;
//                LCDMEM[12] = LCDMEM[13] = i;
//                i<<=1;
//            //
//        //case COUNTER_MODE:
//             //clearLCD();
//            displayScrollText("COUNTING MODE");
//
//              break;



//    }

              displayScrollText("COUNTING MODE");
        //__bis_SR_register(LPM3_bits);
    __bis_SR_register(LPM3_bits | GIE);         // enter LPM3
    __no_operation();
//}
}


/*
 * GPIO Initialization
 */
void Init_GPIO()
{
    // Set all GPIO pins to output low to prevent floating input and reduce power consumption
    GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P3, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P4, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P6, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P7, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);

    GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P2, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P3, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P4, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P5, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P6, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P7, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);
    GPIO_setAsOutputPin(GPIO_PORT_P8, GPIO_PIN0|GPIO_PIN1|GPIO_PIN2|GPIO_PIN3|GPIO_PIN4|GPIO_PIN5|GPIO_PIN6|GPIO_PIN7);

    GPIO_setAsInputPin(GPIO_PORT_P1, GPIO_PIN1);

    // Configure button S1 (P1.2) interrupt
    GPIO_selectInterruptEdge(GPIO_PORT_P1, GPIO_PIN2, GPIO_HIGH_TO_LOW_TRANSITION);
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P1, GPIO_PIN2);
    GPIO_clearInterrupt(GPIO_PORT_P1, GPIO_PIN2);
    GPIO_enableInterrupt(GPIO_PORT_P1, GPIO_PIN2);

    // Configure button S2 (P2.6) interrupt
    GPIO_selectInterruptEdge(GPIO_PORT_P2, GPIO_PIN6, GPIO_HIGH_TO_LOW_TRANSITION);
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P2, GPIO_PIN6);
    GPIO_clearInterrupt(GPIO_PORT_P2, GPIO_PIN6);
    GPIO_enableInterrupt(GPIO_PORT_P2, GPIO_PIN6);

    // Set P4.1 and P4.2 as Secondary Module Function Input, LFXT.
    GPIO_setAsPeripheralModuleFunctionInputPin(
           GPIO_PORT_P4,
           GPIO_PIN1 + GPIO_PIN2,
           GPIO_PRIMARY_MODULE_FUNCTION
           );

    // Disable the GPIO power-on default high-impedance mode
    // to activate previously configured port settings
    PMM_unlockLPM5();
}
/*






 * PORT1 Interrupt Service Routine
 * Handles S1 button press interrupt
 */
#pragma vector = PORT1_VECTOR
__interrupt void PORT1_ISR(void)
{
    P1OUT |= BIT0;    // Turn LED1 On
    switch(__even_in_range(P1IV, P1IV_P1IFG7))
    {
        case P1IV_NONE : break;
        case P1IV_P1IFG0 : break;
        case P1IV_P1IFG1 : break;
        case P1IV_P1IFG2 :
            if ((*S1buttonDebounce) == 0)
            {
                *S1buttonDebounce = 1;                        // First high to low transition

                start=start+1;

                LCD_displayNumber(start);
//                while(1)
//                {
//                start=start+1;
//                __delay_cycles(1000000);
//                //LCD_displayNumber(start);
//                }
                     //displayScrollText("ARD");




                    //P1DIR |= BIT6 | BIT7;                      // P1.6 and P1.7 output
                    //P1SEL0 |= BIT6 | BIT7;                     // P1.6 and P1.7 options select
                        // Disable the GPIO power-on default high-impedance mode to activate
                        // previously configured port settings
                        //PM5CTL0 &= ~LOCKLPM5;
                        //if((*Seconds)%2==0)
                    //{
                        //TA0CCR0 = 128;                             // PWM Period/2
                        //TA0CCTL1 = OUTMOD_7;                       // TACCR1 toggle/set
                        //TA0CCR1 = 32;                              // TACCR1 PWM duty cycle
                        //TA0CCTL2 = OUTMOD_7;                       // TACCR2 toggle/set
                        //TA0CCR2 = 96;                              // TACCR2 PWM duty cycle
                        //TA0CTL = TASSEL_1 | MC_3;
                      // }
                    //else
                        //if((*Seconds)%2==0)
                        //{
                            //TA0CCR0 = 128;                             // PWM Period/2
                           //TA0CCTL1 = OUTMOD_7;                       // TACCR1 toggle/set
                           //TA0CCR1 = 96;                              // TACCR1 PWM duty cycle
                           //TA0CCTL2 = OUTMOD_7;                       // TACCR2 toggle/set
                          //TA0CCR2 = 32;                              // TACCR2 PWM duty cycle
                          //TA0CTL = TASSEL_1 | MC_3;
                                        // }

                        //a= atoi(Seconds);



                // Start debounce timer
                Timer_A_initUpMode(TIMER_A0_BASE, &initUpParam_A0);
            }
        case P1IV_P1IFG3 : break;
        case P1IV_P1IFG4 : break;
        case P1IV_P1IFG5 : break;
        case P1IV_P1IFG6 : break;
        case P1IV_P1IFG7 : break;
    }
}

/*
 * PORT2 Interrupt Service Routine
 * Handles S2 button press interrupt
 */
#pragma vector = PORT2_VECTOR
__interrupt void PORT2_ISR(void)
{
    P4OUT |= BIT0;    // Turn LED2 On
    switch(__even_in_range(P2IV, P2IV_P2IFG7))
    {
        case P2IV_NONE : break;
        case P2IV_P2IFG0 : break;
        case P2IV_P2IFG1 : break;
        case P2IV_P2IFG2 : break;
        case P2IV_P2IFG3 : break;
        case P2IV_P2IFG4 : break;
        case P2IV_P2IFG5 : break;
        case P2IV_P2IFG6 :
            if ((*S2buttonDebounce) == 0)
            {
                *S2buttonDebounce = 1;                        // First high to low transition

                //clearLCD();
                displayScrollText("BYE");
                LCD_displayNumber(start);

                //                Disable the GPIO power-on default high-impedance mode to activate
                //                previously configured port settings
                                PM5CTL0 &= ~LOCKLPM5;
                                if(start%2==0)
                                {
                                 TA0CCR0 = 128;                             // PWM Period/2
                                 TA0CCTL1 = OUTMOD_7;                       // TACCR1 toggle/set
                                 TA0CCR1 = 32;                              // TACCR1 PWM duty cycle
                                                       // TACCR2 toggle/set
                                                              // TACCR2 PWM duty cycle
                                 TA0CTL = TASSEL_1 | MC_3;
                                 }
                                else
                                {
                                    TA0CCR0 = 128;                             // PWM Period/2
                                    TA0CCTL1 = OUTMOD_7;                       // TACCR1 toggle/set
                                    TA0CCR1 = 96;                              // TACCR1 PWM duty cycle

                                    TA0CTL = TASSEL_1 | MC_3;
                                }
                // Start debounce timer
                Timer_A_initUpMode(TIMER_A0_BASE, &initUpParam_A0);

                }



        case P2IV_P2IFG7 : break;
    }

}


/*
 * Timer A0 Interrupt Service Routine
 * Used as button debounce timer
 */
#pragma vector = TIMER0_A0_VECTOR
__interrupt void TIMER0_A0_ISR (void)
{
    // Both button S1 & S2 held down  i.e they are pressed
    if (!(P1IN & BIT2) && !(P2IN & BIT6))
    {
        holdCount++;
        if (holdCount == 40)
        {
            // Stop Timer A0
            Timer_A_stop(TIMER_A0_BASE);

            // Change mode
           // if (*mode == STARTUP_MODE)
                //(*mode) = COUNT_MODE;

            __bic_SR_register_on_exit(LPM3_bits);                // exit LPM3
        }
    }

    // Button S1 released
    if (P1IN & BIT2)
    {
        *S1buttonDebounce = 0;                                   // Clear button debounce
        P1OUT &= ~BIT0;
    }

    // Button S2 released
    if (P2IN & BIT6)
    {
        *S2buttonDebounce = 0;                                   // Clear button debounce
        P4OUT &= ~BIT0;
    }

    // Both button S1 & S2 released
    if ((P1IN & BIT2) && (P2IN & BIT6))
    {
        // Stop timer A0
        Timer_A_stop(TIMER_A0_BASE);
        //if (*mode == COUNT_MODE)
            //if (!(*stopWatchRunning))
                __bic_SR_register_on_exit(LPM3_bits);            // exit LPM3

    }
}
